core/app/Http/Controllers/SiteController.php

    public function __construct()
    {
        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

    public function index()
    {

        $pageTitle = 'Home';

        $sections = Page::where('name', 'home')->first();

        if (!$sections) {

            $sections = Page::create([
                'name' => 'home',
                'sections' => ['about'],
                'slug' => 'home',
                'seo_description' => 'home',
                'page_order' => 1
            ]);
        }

        $plan = Plan::where('status', 1)->get();
---
select * from `pages` where `name` = 'home' limit 1
select * from `plans` where `status` = 1

    public function page(Request $request)
    {

        $page = Page::where('slug', $request->pages)->first();
---
select * from `pages` where `slug` = 'lucky-ticket' limit 1

    public function allInvestmentPlan()
    {
        $pageTitle = "Investment Plan";
        $plans = Plan::where('status', 1)->get();
---
select * from `plans` where `status` = 1

    public function allblog()
    {
        $theme = GeneralSetting::first()->theme;

        $pageTitle = 'Blog';
        $blogs = SectionData::where('theme', $theme)->where('key', 'blog.element')->paginate(6);
---
select * from `general_settings` limit 1
select * from `section_data` where `theme` = 4 and `key` = 'blog.element' limit 6 offset 0
select count(*) as aggregate from `section_data` where `theme` = 4 and `key` = 'blog.element'