core/app/Http/Controllers/UserController.php

    public function __construct()
    {
        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

    public function dashboard()
    {


        $pageTitle = "Dashboard";
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->latest()->first('amount');
        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();
        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::with('payment')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');

        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('final_amount');
---
select sum(`amount`) as aggregate from `payments` where `user_id` = 1 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `payments` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 1
select count(*) as aggregate from `payments` where `user_id` = 1
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 1 and `status` = 1
select count(*) as aggregate from `user_interests` where `user_id` = 1
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 1
select sum(`amount`) as aggregate from `payments` where `user_id` = 1 and `payment_status` = 2
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 1 and `status` = 0
select sum(`final_amount`) as aggregate from `deposits` where `user_id` = 1 and `payment_status` = 1